Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/adult_and_life_long_education/adult_education.html.txt.tmx
Source language: en
Languages: ga

source: Adult education courses are designed so that you can return to education in flexible ways
ga: Tá cúrsaí oideachais daoine fásta deartha ionas gur féidir leat filleadh ar an oideachas ar bhealaí solúbtha

source: They take account of your particular needs and circumstances as an adult
ga: Cuireann siad do riachtanais agus do chúinsí ar leith san áireamh mar dhuine fásta

source: There are part-time and full-time courses available
ga: Tá fáil ar chúrsaí páirtaimseartha agus lánaimseartha

source: A number of organisations provide specialist help and advice about returning to education
ga: Soláthraíonn roinnt eagraíochtaí cabhair agus comhairle speisialaithe faoi fhilleadh ar an oideachas

source: You don't need formal qualifications in order to take part in many full-time and part-time courses that are on offer
ga: Ní gá duit cáilíochtaí foirmiúla a bheith agat chun páirt a ghlacadh in go leor de na cúrsaí lánaimseartha agus páirtaimseartha atá ar fáil

source: Many courses are provided through your local Education and Training Board
ga: Cuirtear go leor cúrsaí ar fáil trí do Bhord Oideachais agus Oiliúna áitiúil

source: These include adult literacy programmes and courses for early school-leavers, opportunities to return to study for the Leaving Certificate or other certificates and a wide range of vocational training linked to business and industry
ga: Ina measc seo tá cláir agus cúrsaí litearthachta daoine fásta dóibh siúd a d’fhág an scoil go luath, deiseanna chun filleadh agus staidéar a dhéanamh don Ardteistiméireacht nó do theastais eile nó réimse fairsing oiliúint ghairmoideachais atá nasctha leis an ngnó nó leis an tionscal

source: Some courses are generally only open to you if you have completed your secondary education
ga: Ní bhíonn roinnt cúrsaí ar fáil duit ach amháin má chríochnaigh tú oideachas dara leibhéal

source: These include Post-Leaving Certificate Courses and college-based training courses for apprentices, as well as full-time and part-time third-level courses
ga: Ina measc seo tá Cúrsaí Iar-Ardteistiméireachta agus cúrsaí oiliúna a bhíonn ar siúl i gcoláistí le haghaidh printíseach, mar aon le cúrsaí tríú leibhéal lánaimseartha agus páirtaimseartha

source: However, you should check the entry requirements with the school or college as some courses make exceptions for mature students
ga: Ar a shon sin, ba cheart duit na riachtanais iontrála a sheiceáil leis an scoil nó leis an gcoláiste mar gheall go ndéanann roinnt cúrsaí eisceachtaí i gcás mic léinn lánfhásta

source: There are a number of education and training schemes and supports available that can support you to return to education and training
ga: Tá roinnt tacaíochtaí agus scéimeanna oideachais agus oiliúna ar fáil ar féidir leo tacú leat filleadh ar oideachas agus oiliúint

source: Education and Training Boards
ga: Boird Oideachais agus Oiliúna

source: Since 1 July 2013, Education and Training Boards (ETBs) replaced Vocational Educational Committees (VECs)
ga: Ó 1 Iúil 2013, cuirfear Boird Oideachais agus Oiliúna (BOO) in áit coistí gairmoideachais

source: All services provided by VECs will continue to be provided by ETBs
ga: Leanfaidh na BOO an uile sheirbhíse soláthartha ag na coistí gairmoideachais a sholáthar
